package main

import (
	"fmt"
	"math/rand"
	"strings"
	"time"
)

func main() {
	s := "{n}是{v}{n}, {v}行业{n}的关键。{n}是{v}{n}{n}，通过{n}和{n}达到{n}。{n}是在{n}采用{n}打法达成{n}。" +
		"{n}{n}作为{n}为产品赋能，{n}作为的评判标准，{n}作为{n}的核心。亮点是{n}，优势是{n}。{v}整个{n}，{v}{n}{v}{n}。" +
		"{n}是{n}达到{n}标准。短期看，{n}是突破口; 长期看{n}是形成壁垒的关键因素。"

	v := "复盘，赋能，加持，沉淀，倒逼，落地，串联，协同，反哺，兼容，包装，重组，履约，响应，量化，布局，联动，细分，梳理，输出，加速，" +
		"共建，支撑，融合，聚合，集成，对标，聚焦，抓手，拆解，抽象，摸索，提炼，打通，打透，吃透，迁移，分发，分装，辐射，围绕，复用，" +
		"渗透，扩展，开拓，皮实，共创，共建，解耦，集成，对齐，拉齐，对焦，给到，拿到，死磕，拉通，迂回"

	n := "漏斗，中台，闭环，打法，纽带，矩阵，刺激，规模，场景，维度，格局，形态，生态，体系，认知，玩法，体感，感知，调性，心智，战役，" +
		"合力，赛道，基因，模型，载体，横向，通道，补位，试点，布局，联动，价值，细分，梳理，提炼，支撑，解法，脑暴，分层，心力，感知度，" +
		"方法论，组合拳，引爆点，点线面，精细化，差异化，平台化，结构化，影响力，耦合性，便捷性，一致性，端到端，短平快，护城河，体验感，" +
		"颗粒度，加速器，生命周期，价值转化，强化认知，资源倾斜，完善逻辑，抽离透传，复用打法，商业模式，快速响应，定性定量，关键路径，" +
		"去中心化，结果导向，垂直领域，归因分析，体验度量，信息屏障，资源整合，数据驱动，三级火箭"

	vList := strings.Split(v, "，")
	nList := strings.Split(n, "，")

	rand.Seed(time.Now().UnixNano())
	for strings.Contains(s, "{v}") {
		s = strings.Replace(s, "{v}", vList[rand.Intn(len(vList))], 1)
	}

	for strings.Contains(s, "{n}") {
		s = strings.Replace(s, "{n}", nList[rand.Intn(len(nList))], 1)
	}
	fmt.Println(s)
}
